---
title: MEPCurve
classe: Autodesk.Revit.DB.MEPCurve
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.HostObject
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 7
---

# MEPCurve

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `ConnectorManager ConnectorManager { get; }` | `mEPCurve.ConnectorManager` | ConnectorManager |
| `Double Diameter { get; }` | `mEPCurve.Diameter` | Double |
| `Double Height { get; }` | `mEPCurve.Height` | Double |
| `Double LevelOffset { get; set; }` | `mEPCurve.LevelOffset` | Double |
| `MEPSystem MEPSystem { get; }` | `mEPCurve.MEPSystem` | MEPSystem |
| `Level ReferenceLevel { get; set; }` | `mEPCurve.ReferenceLevel` | Level |
| `Double Width { get; }` | `mEPCurve.Width` | Double |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```